Repository: tvraman/emacspeak
Catalog: obsolete/debian/po/*.po
Languages: sv

source: Default speech server:
sv: Standardserver för speech:

source: The /etc/emacspeak.conf file will be configured so that the command '/usr/bin/emacspeak' will start Emacs with emacspeak support using this server.
sv: Filen /etc/emacspeak.conf skapas så att kommandot "/usr/bin/emacspeak" startar Emacs med emacspeak-stöd på den här servern.

source: You may change the selection later by running 'dpkg-reconfigure emacspeak' as root, or temporarily override the selection by setting the environment variable DTK_PROGRAM.
sv: Du kan ändra valet senare genom att köra "dpkg-reconfigure emacspeak" som root eller temporärt överlagra inställningen via miljövariabeln DTK_PROGRAM.

source: Hardware port of the speech generation device:
sv: Adress till speech-enhet.

source: If a hardware device is used to generate speech, please enter the Unix device file associated with it, such as '/dev/ttyS0' or '/dev/ttyUSB0'.
sv: Om en enhet i hårdvaran ska användas för att skapa speech måste dess Unixenhet anges. Exempelvis "/dev/ttyS0" eller "/dev/ttyUSB0"

source: If you use a software method to generate speech, please enter 'none'.
sv: Om speech skapas av mjukvaran anger du "none".

source: ${port} is not a character special device
sv: ${port} är inte en specialenhet

source: Users of speech server:
sv: Användare av speechsevern:

source: Users must be members of group ${group} to access the speech server connected to ${port}. Please review the space-separated list of current members of that group, and add or remove usernames if needed.
sv: Användare måste vara med i gruppen ${group} för att komma åt speech-servern ansluten på ${port}. Kontrollera listan med användare, lägg till eller ta bort användarnamn om så behövs. Listan separeras med mellanslag.

source: If you later add users to the system, you can either reconfigure the emacspeak package afterwards, or enroll the user in ${group} with 'adduser ${group} <user>'.
sv: Om du lägger till användare i systemet framöver kan du antingen köra den här guiden eller manuellt lägga till användaren eller användarna i rätt grupp. Använd kommandot dpkg-reconfigure emacspeak eller lägg till användare manuellt i gruppen ${group} med kommandot "adduser ${group} <användare>".

source: Group membership is checked at login time, so new members must log out and log in again before using the speech server.
sv: Vid inloggningen kontrolleras vilka grupper en användare är medlem i så nya användare måste logga in och sedan ut igen innan de kan använda speechservern.

source: Invalid username ${user}
sv: Felaktigt användarnamn ${user}

source: There is no user named ${user}, so no such user could be added to ${group}.
sv: Det finns ingen användare ${user}, med andra ord så kunde inte användaren läggas till i gruppen ${group}.

source: ${port} non-writable by unprivileged users
sv: ${port} är inte skrivbar för vanliga användare

source: Since the speech device is connected to ${port}, unprivileged users must have read/write access to that device.
sv: I och med att speech-enheten är ansluten på ${port} måste vanliga användare ha rättighet att skriva till enheten.

source: You should modify the device permissions with 'chmod a+rw ${port}' or modify the device group with 'chown root:dialout ${port}', then reconfigure emacspeak with 'dpkg-reconfigure emacspeak'.
sv: Du måste ändra tillståndet med kommandot "chmod a +rw ${port}" eller grupptillståndet med "chown root.dialout ${port}" konfigurera sedan om emacspeak med "dpkg-reconfigure emacspeak".
